Tekla.Structures.Drawing.IIsEqual
The IIsEqual interface is for comparing objects using the function IsEqual().

Tekla.Structures.Drawing.IIsEqual.IsEqual(System.Object)
Compares the current object with the given object.
Checks every field of both objects for equality.
ObjectToCompare: An object of the same type to be used for comparing.
Returns: True if all the field values of both objects match.